Revit 2027 API
ExternalResourceServerExtensions.GetCADLinkOperations Method
 Gets the specific methods supported by external resource CAD Links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CADLinkOperations GetCADLinkOperations()
Public Function GetCADLinkOperations As CADLinkOperations
public:
CADLinkOperations^ GetCADLinkOperations()
member GetCADLinkOperations : unit -> CADLinkOperations
Return Value
CADLinkOperations
 The specific methods supported by external resource CAD Links.
See Also
Reference
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace